In [1]:
import numpy as np
import pandas as pd

In [5]:
working_dir = "C:/Machine Learning/Hackathons/Sample Data/Recommender Data/"

In [10]:
movies =  pd.read_csv(working_dir + "movies.csv")
# open the csv file and save it in utf-8 coding, otherwise you will get the error:
#UnicodeDecodeError: 'utf-8' codec can't decode byte 0xe9 in position 31: invalid continuation byte

In [12]:
ratings =  pd.read_csv(working_dir + "ratings.csv")
tags = pd.read_csv(working_dir + "tags.csv")

In [17]:
print(movies.shape) 
movies.head()

(2500, 3)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [18]:
print(ratings.shape) 
ratings.head()

(264505, 4)

   userId  movieId  rating   timestamp
0   12882        1     4.0  1147195252
1   12882       32     3.5  1147195307
2   12882       47     5.0  1147195343
3   12882       50     5.0  1147185499
4   12882      110     4.5  1147195239

In [19]:
print(tags.shape) 
tags.head()

(94875, 4)

   movieId  userId           tag   timestamp
0     3916   12882        sports  1147195545
1     4085   12882  Eddie Murphy  1147195966
2    33660   12882        boxing  1147195514
3     1197     320     must show  1145964801
4     1396     320     must show  1145964810